import { TemplateRender } from "../../../components/TemplateRender/TemplateRender";
import { TTemplate } from "../../../types/types";

export const template = [
  {
    element: "LEAD_BLOCK",
    text: "Приезжая в Рязанскую область впервые, путешественник норовит запутаться в местной топонимике и истории. Почему помимо обычной Рязани тут есть Рязань Старая? Когда появилась новая Рязань? Что делает в этом списке Переяславль-Рязанский? \n\nА еще почему множество местных жителей считают чак-чак национальным блюдом? Наконец, что такое «рязанское чудо» и почему от него пострадали коровы в СССР? Чтобы во всем разобраться, стоит бегло пробежаться по самым интересным страницам истории. Благо это недолго и увлекательно.",
  },
  {
    element: "LONG_READ_BLOCK",
    title: "Три Рязани",
    subElements: [
      {
        element: "TEXT_BLOCK",
        text: "Начнем с местечка под Спасском в 65 километрах к юго-востоку от современной Рязани. В XII веке здесь, на высоком берегу Оки, раскинулась красавица древняя Рязань, столица Рязанского княжества, один из крупнейших русских городов, важный центр культурной, политической, экономической и военной жизни своей эпохи. Город-страж юго-восточных окраин Руси не раз отражал вражеские набеги, пока не пал под натиском ордынской рати.\n\nДальнейшую историю легко вспомнят отличники — «Повесть о разорении Рязани Батыем» входит в школьную программу. В декабре 1237 года несметные полчища монгольского хана вторглись в границы княжества и осадили город. После пяти дней тяжелых боев Рязань была повержена и полностью разрушена. Местный фольклор сохранил имя местного боярина и воеводы Евпатия Коловрата. В момент битвы он был в Чернигове, а вернувшись к пепелищу, собрал отряд из выживших жителей и отправился в погоню за неприятелем. Горстка рязанских бойцов оказалась настолько свирепой в атаке ордынского войска, что поразила Батыя. Остановить рязанцев смогли лишь камнеметные орудия. Хан же в знак уважения к доблести противника передал тело Коловрата пятерым выжившим воинам из его отряда.\n\nРазрушенный город так и не восстановился. Столица княжества вскоре была перенесена в Переяславль-Рязанский (забежим вперед — указом Екатерины II он будет переименован в нынешнюю Рязань). А исконная Рязань со временем получила приставку «Старая». Старая Рязань — единственная столица княжеств Древней Руси, превратившаяся в «мертвый город». Сегодня городище представляет собой широкое ровное поле, окруженное величественными валами.",
      },
      {
        element: "LONG_READ_ITEM_BLOCK",
        srcImg: "https://i.ibb.co/B2SWtKm/1.jpg",
      },
    ],
  },
  {
    element: "LONG_READ_BLOCK",
    title: "Враг не пройдет",
    subElements: [
      {
        element: "TEXT_BLOCK",
        text: "Впрочем, славных побед было значительно больше. Несколько веков подряд Рязанские земли отражали постоянные налеты Дикого поля, а с течением времени и вовсе вошли в Большую засечную черту Российского государства. Линия оборонительных сооружений протянулась на 500 километров и закрыла путь неприятелю от Мещёры до Брянских земель. Леса, входящие в линию укреплений, оберегались особым указом, а селившиеся в горячих точках добровольцы за верную службу освобождались от уплаты податей.\n\nПомимо Переяславля-Рязанского в засечную черту вошли города-крепости Шацк, Сапожок, Ряжск, Скопин, Пронск и Михайлов — добрая половина современной Рязанской области.",
      },
      {
        element: "FACT_BLOCK",
        text: "Одно из сражений стоит особняком в русской военной истории. Речь идет о битве на Воже 11 августа 1378 года близ города Глебова, ныне в Рыбновском районе Рязанской области. Именно тут русские войска впервые одержали крупную победу, разгромив крупное татарское войско. Миф о несокрушимости военных сил Орды был сломлен, среди татар начались распри, а русский народ воспрянул духом. Сегодня специалисты называют битву на Воже репетицией Куликовской битвы, перевернувшей ход истории.",
      },
    ],
  },
  {
    element: "LONG_READ_BLOCK",
    title: "Касимовское ханство",
    subElements: [
      {
        element: "TEXT_BLOCK",
        text: "Отвлечемся ненадолго от Рязани и отправимся в город Касимов на северо-восток Рязанской области. Тут, посреди глухих русских лесов, обосновалось татарское ханство, до сих пор в небо стремится гордая стрела старинного минарета и, по легенде, находится усыпальница знаменитой казанской царицы Сююмбике.\n\nА началось все в XV веке, когда молодой казанский хан Касим, спасаясь от кровожадного брата, перешел на службу к Василию II. За поддержку будущего московского князя в борьбе за престол он и получил земли в глубинке Мещёрского края. Касим назвал подаренный ему городок своим именем и честно отрабатывал оказанное доверие — местное татарское войско выступало на стороне русских даже против Орды. Касимовское ханство существовало более 200 лет, после чего вернулось в состав московских земель. Достоверно известно, что тут провела последние годы жизни правительница Казанского царства Сююмбике. Дозорная башня Сююмбике сегодня является архитектурной эмблемой Казани, сама же царица покоится среди мещёрских лесов.\n\nКасимов же до сих пор разделен на две половины — мусульманскую и православную. Минарет XV века мирно соседствует с золотыми куполами церквей, над текие Шах-Али хана несутся малиновые перезвоны колоколов, а местные жители считают чак-чак и плов с кониной своими национальными блюдами.",
      },
      {
        element: "LONG_READ_ITEM_BLOCK",
        srcImg: "https://i.ibb.co/wz3vbNB/2.jpg",
      },
    ],
  },
  {
    element: "LONG_READ_BLOCK",
    title: "Новая Рязань",
    subElements: [
      {
        element: "FACT_BLOCK",
        text: "В 1778 году Переяславль-Рязанский был переименован в Рязань и стал административным центром Рязанской губернии. Произошло это с легкой руки Екатерины II, решившей навести порядок в стране и затеявшей масштабную административную реформу.",
      },
      {
        element: "TEXT_BLOCK",
        text: "Досталось всем — страна была разделена на губернии с населением 300-400 тысяч человек, те, в свою очередь, дробились на уезды по 20-30 тысяч душ населения. Исходя из этого, Рязанская губерния получила 11 уездов и точные границы с соседями, а заодно обзавелась гербом в виде щита с фигурой князя-воина, вооруженного мечом.\n\nРегулярный план застройки Рязани, а также социальные институты вроде домов призрения и богаделен — тоже заслуга императорского внимания. В те же годы в Рязани появился Оперный дом и первая гимназия, в уездах стали открываться малые народные училища. Чуть позже начала издаваться городская газета, а спустя полвека открыла двери публичная библиотека. Культура плотно вошла в жизнь простых жителей.",
      },
      {
        element: "LONG_READ_ITEM_BLOCK",
        srcImg: "https://i.ibb.co/kKV8Gh1/3.jpg",
      },
    ],
  },
  {
    element: "LONG_READ_BLOCK",
    title: "Рельсы-рельсы, шпалы-шпалы",
    subElements: [
      {
        element: "TEXT_BLOCK",
        text: "К середине 60-х годов XIX века в Рязани заработала железная дорога, соединившая сердце губернии со столицей. В это же время, за каких-то рекордных два года, была выстроена и открыта Рязанско-Уральская железная дорога, ставшая главной путевой артерией между Рязанью, Москвой и западным Казахстаном. Некогда по этому маршруту проходил главный гужевой маршрут из юго-восточных степей в столицу. Новая железная дорога унаследовала его популярность, став одной из самых востребованных и доходных в России. Рязанско-Уральская железная дорога была настолько богата, что стала единственной в стране, имевшей собственную... флотилию речных судов. К началу XX века новые пути охватывали около четырех с половиной тысяч километров, а РУЖД принадлежали собственные лесопильные, шпалопропиточные и газовые заводы по всей стране, на ее средства строились школы, библиотеки, лечебницы для рабочих...\n\nНаравне с ж/д гигантом в регионе действовала узкоколейная железная дорога. Именно по ней в 1930 году в Мещёру приехал писатель Константин Паустовский. «Узкоколейка в Мещёрских лесах — самая неторопливая железная дорога в Союзе», — признавался он. В повести «Мещёрская сторона» писатель рассказывал о своем путешествии: «Пассажиры с вещами сидели на площадках — вещи в вагон не влезали. Изредка в пути с площадки на полотно начинали вылетать мешки, корзины, плотничьи пилы, а за вещами выскакивал и их обладатель, нередко довольно древняя старуха. Неопытные пассажиры пугались, а опытные, скручивая козьи ножки и поплевывая, объясняли, что это самый удобный способ высаживаться из поезда поближе к своей деревне».",
      },
    ],
  },
  {
    element: "LONG_READ_BLOCK",
    title: "СССР — всему миру пример",
    subElements: [
      {
        element: "TEXT_BLOCK",
        text: "Сразу после Великой Отечественной войны началось бурное развитие города. Благодаря доблестному труду простого человека Рязань превратилась в крупный промышленный, научный и военный центр европейской части СССР. Один за другим выросли заводы-гиганты, занимающие целые городские районы. Протянул в небо трубы крупнейший в Европе нефтеперерабатывающий завод. Огромную территорию единственного в стране производителя картофелеуборочной техники — завода «Рязсельмаш» — было не объять взором. Честно и добросовестно трудились рабочие завода САМ — его интеграторы эксплуатировались в Антарктиде, а продукцию с маркой Рязанского станкостроительного завода с руками отрывали в Китае, Бирме, Египте и Швеции. В обстановке эмоционального подъема произошел запуск комплекса Торгового городка — Рязанской ВДНХ, выполненной в пышной стилистике сталинского ампира.\n\nСельскохозяйственные успехи Рязани внесли решающий вклад в экономику Страны Советов. В 1955 году Рязанская область заняла пятое место в стране и четвертое в РСФСР по производству молока, а по выращиванию махорки вошла в тройку лидеров республики. Впрочем, радостную статистику испортило «рязанское чудо» — знаменитая махинация первого секретаря Рязанского обкома КПСС Алексея Ларионова. В погоне за званием Героя Социалистического Труда чиновник пообещал за год утроить государственные заготовки мяса. Реализация амбициозного проекта оказалась плачевной: первым был перебит государственный молочный скот, потом под нож пошла личная крестьянская скотина, дальше сырье пришлось тайком закупать по всей стране... Когда мясная афера стала очевидной, Ларионов скончался от сердечного приступа.\n\nСпустя время репутацию городу вернула председатель Рязанского совета народных депутатов Надежда Чумакова.",
      },
      {
        element: "FACT_BLOCK",
        text: "Чуткое и умелое руководство позволило более чем в семь раз увеличить население города — с 72 до 520 тысяч человек. Рекордные темпы строительства и благоустройства, введение в эксплуатацию новых социальных, культурно-бытовых объектов, сотни километров троллейбусных, трамвайных и автобусных маршрутов — за 26 лет добросовестного труда Надежда Чумакова не раз принимала врученное Рязани переходящее Красное знамя, а город неоднократно объявлялся лидером в благоустройстве и озеленении среди городов Советского Союза.",
      },
      {
        element: "LONG_READ_ITEM_BLOCK",
        srcImg: "https://i.ibb.co/zJYq0fS/4.jpg",
      },
    ],
  },
  {
    element: "LONG_READ_BLOCK",
    title: "Наши дни",
    subElements: [
      {
        element: "TEXT_BLOCK",
        text: "Пережив лихие 90-е и не менее интересные нулевые, Рязань продолжает расти и развиваться. Город старается идти в ногу с требованиями современной жизни, но не теряет связи с корнями и не забывает о собственной идентичности. И, конечно, гостеприимно встречает путешественников и вдохновенных исследователей русской глубинки.",
      },
      {
        element: "LONG_READ_ITEM_BLOCK",
        srcImg: "https://i.ibb.co/YjR3FxY/5.jpg",
      },
    ],
  },
];


export const Istoriya = () => {
  return (
    <div className="grid gap-2">
      <div className="font-medium text-lg">История</div>
      <TemplateRender template={template as TTemplate[]} />
    </div>
  );
};
